Revit 2027 API
DistributionSysTypeSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual DistributionSysTypeSetIterator ForwardIterator()
Public Overridable Function ForwardIterator As DistributionSysTypeSetIterator
public:
virtual DistributionSysTypeSetIterator^ ForwardIterator()
abstract ForwardIterator : unit -> DistributionSysTypeSetIterator
override ForwardIterator : unit -> DistributionSysTypeSetIterator
Return Value
DistributionSysTypeSetIterator
Returns a forward moving iterator to the set.
See Also
Reference
DistributionSysTypeSet Class
Autodesk.Revit.DB.Electrical Namespace